In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\gprec\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\users\gprec\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\gprec\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\gprec\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\gprec\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np

In [3]:
dataFrame = pd.DataFrame()
print(dataFrame)

Empty DataFrame
Columns: []
Index: []

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(11)

In [6]:
df = pd.DataFrame(randn(3, 3), index = 'A B C'.split(), columns = "X Y Z".split())

In [7]:
df

          X         Y         Z
A  1.749455 -0.286073 -0.484565
B -2.653319 -0.008285 -0.319631
C -0.536629  0.315403  0.421051

In [8]:
df['X']

A    1.749455
B   -2.653319
C   -0.536629
Name: X, dtype: float64

In [9]:
df[['X', 'Z']]

          X         Z
A  1.749455 -0.484565
B -2.653319 -0.319631
C -0.536629  0.421051

In [10]:
df.X

A    1.749455
B   -2.653319
C   -0.536629
Name: X, dtype: float64

In [11]:
type(df['X'])

pandas.core.series.Series

In [12]:
df['NEW'] = df['X'] + df['Y']

In [13]:
df

          X         Y         Z       NEW
A  1.749455 -0.286073 -0.484565  1.463382
B -2.653319 -0.008285 -0.319631 -2.661603
C -0.536629  0.315403  0.421051 -0.221227

In [14]:
df.drop('NEW', axis=1)

          X         Y         Z
A  1.749455 -0.286073 -0.484565
B -2.653319 -0.008285 -0.319631
C -0.536629  0.315403  0.421051

In [15]:
df

          X         Y         Z       NEW
A  1.749455 -0.286073 -0.484565  1.463382
B -2.653319 -0.008285 -0.319631 -2.661603
C -0.536629  0.315403  0.421051 -0.221227

In [16]:
df.drop('NEW', axis = 1, inplace = True)

In [17]:
df

          X         Y         Z
A  1.749455 -0.286073 -0.484565
B -2.653319 -0.008285 -0.319631
C -0.536629  0.315403  0.421051

In [18]:
df.drop('A')

          X         Y         Z
B -2.653319 -0.008285 -0.319631
C -0.536629  0.315403  0.421051

In [19]:
df.loc['A']

X    1.749455
Y   -0.286073
Z   -0.484565
Name: A, dtype: float64

In [20]:
df.iloc[0]

X    1.749455
Y   -0.286073
Z   -0.484565
Name: A, dtype: float64

In [21]:
df>0

       X      Y      Z
A   True  False  False
B  False  False  False
C  False   True   True

In [22]:
df[df > 0]

          X         Y         Z
A  1.749455       NaN       NaN
B       NaN       NaN       NaN
C       NaN  0.315403  0.421051

In [23]:
df[df['X'] > 0]

          X         Y         Z
A  1.749455 -0.286073 -0.484565

In [24]:
df[df['X'] < 0]['Y']

B   -0.008285
C    0.315403
Name: Y, dtype: float64

In [25]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})

pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [26]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [27]:
df = pd.read_csv("titanic_train.csv")

In [28]:
df = df[['survived', 'age', 'fare']]

In [29]:
df.head()

   survived   age     fare
0         1   NaN   7.7333
1         0  38.0   8.6625
2         0  30.0  24.1500
3         1  54.0  23.0000
4         0  40.0  13.0000

In [41]:
df.isnull()[100 : 103]

     survived    age   fare
100     False  False  False
101     False   True  False
102     False   True  False

In [31]:
df.isnull().sum()

survived      0
age         174
fare          1
dtype: int64

In [32]:
new_df = df.fillna(0)

In [33]:
new_df[99 : 102]

     survived   age  fare
99          0  47.0  7.25
100         0  21.0  8.05
101         0   0.0  8.05

In [34]:
new_df = df.fillna(method = "ffill")
new_df[99 : 102]

     survived   age  fare
99          0  47.0  7.25
100         0  21.0  8.05
101         0  21.0  8.05

In [35]:
new_df = df.fillna(method = "ffill", limit = 1)
new_df[100 : 103]

     survived   age    fare
100         0  21.0  8.0500
101         0  21.0  8.0500
102         0   NaN  8.6625

In [36]:
new_df = df.fillna(method = "bfill")
new_df[99 : 102]

     survived   age  fare
99          0  47.0  7.25
100         0  21.0  8.05
101         0  42.0  8.05

In [37]:
new_df = df.interpolate()
new_df[100 : 103]

     survived    age    fare
100         0  21.00  8.0500
101         0  26.25  8.0500
102         0  31.50  8.6625

In [38]:
new_df = df.dropna()
new_df.shape

(675, 3)

In [39]:
new_df = df.dropna(how='all')
new_df.shape

(850, 3)

In [40]:
new_df = df.dropna(axis = 1)
new_df.shape

(850, 1)